app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    # @songs = Song.all
    if params[:artist_id]
      @artist = Artist.find_by_id(params[:artist_id])
      if @artist
        @songs = @artist.songs
      else
        redirect_to artists_path, alert: "Artist not found."
      end
    else
      @songs = Song.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    # @song = Song.find(params[:id])
    @song = Song.find_by_id(params[:id])